Cases/shippingBox_0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       latestTime;

startTime       0.001;

stopAt          endTime;

endTime         3600000;

deltaT          0.05;

writeControl    adjustable;

writeInterval   1200;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

maxCo           50;

// Maximum diffusion number
maxDi           10.0;

adjustTimeStep  yes;

functions
{
	#includeFunc singleGraph
    //finds minimal and maximal Values in batteries region
    minMaxValues
    {
        type        fieldMinMax;
        libs        ("libfieldFunctionObjects.so");
        region      batteries;
        location    false;
        write       false;
        fields      (T);
        executeControl  timeStep;
        executeInterval 30;
        writeControl    timeStep;
        writeInterval   30;
    }

    //controls simulation during runtime
    runTimeControl
    {
        type        runTimeControl;
        libs        ("libutilityFunctionObjects.so");
        region      batteries;
        executeControl  timeStep;
        executeInterval 30;
        writeControl    timeStep;
        writeInterval   30;
        conditions
        {
            // if minimal temperature exceeds value, simulation stops
            minTempExceeded
            {
                type            minMax;
                functionObject  minMaxValues;
                fields          (min(T));
                mode            maximum;
                value           295;
            }
        }
    }

}

// ************************************************************************* //
