Cases/shippingBox_0/system/batteries/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

T
{
    internalField   uniform 270;

    boundaryField
    {
		symmetryPlanes
        {
			type            symmetry;
        }
        batteries_to_shippingBox
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;            
            Tnbr            T;
            kappaMethod     directionalSolidThermo;
            alphaAni        Anialpha;
            value           uniform 270;
        }
    }
}

p
{
    internalField   uniform 100000;

    boundaryField
    {
		symmetryPlanes
        {
			type            symmetry;
        }
    }
}

// ************************************************************************* //
